package entities

/**
 * Сущность
 *
 * Структура описывает абстрактную сущность
 * с базовыми полями и методами.
 *
 * @author		Vadim Oleynik
 * @version		1.0.0
 * @copyright	MIT License
 */
type Entity struct {
	/**
	 * Единицы здоровья сущности
	 */
	HP int
	/**
	 * Единицы магии сущности
	 */
	MP int
	/**
	 * Координаты X, Y расположения сущности в игровом мире
	 */
	X, Y int
	/**
	 * Ширина и высота изображения сущности
	 */
	Width, Height int
	/**
	 * Скорость передвижения сущности
	 */
	Speed int
	/**
	 * Урон от атак, наносимых сущностью
	 */
	Damage int
	/**
	 * Единицы брони сущности
	 */
	Armor int
}

/**
 * Метод для перемещения сущности по игровому миру
 */
func (e *Entity) Move() {

}

/**
 * Метод для атаки сущности
 */
func (e *Entity) Attack() {

}

/**
 * Метод для рендеринга изображения сущности
 */
func (e *Entity) Draw() {

}
